Revit 2027 API
StructuralSectionHotRolled.FlangeThickness Property
 Flange Thickness.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FlangeThickness { get; set; }
Public Property FlangeThickness As Double
	Get
	Set
public:
property double FlangeThickness {
	double get ();
	void set (double value);
}
member FlangeThickness : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionHotRolled Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace